Repository: kskovpen/autotools
Catalog: gettext-0.26/gettext-runtime/po/*.po
Languages: it, sv

source: Copyright (C) %s Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later <%s> This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
it: Copyright (C) %s Free Software Foundation, Inc. Licenza GPLv3+: GNU GPL versione 3 o successiva <%s> Questo è software libero: siete liberi di modificarlo e ridistribuirlo. Non c'è ALCUNA GARANZIA, nella misura consentita dalla legge.
sv: Copyright © %s Free Software Foundation, Inc. Licens GPLv3+: GNU GPL version 3 eller senare <%s> Detta program är fri programvara. Du kan modifiera och distribuera den. Det finns inte NÅGON SOM HELST GARANTI, till den grad som lagen tillåter.

source: Written by %s.
it: Scritto da %s.
sv: Skrivet av %s.

source: too many arguments
it: troppi argomenti
sv: för många argument

source: missing arguments
it: argomenti mancanti
sv: argument saknas

source: Try '%s --help' for more information.
it: Usare "%s --help" per maggiori informazioni.
sv: Försök med ”%s --help” för mer information.

source: Usage: %s [OPTION] [SHELL-FORMAT]
it: Uso: %s [OPZIONE] [FORMATO-SHELL]
sv: Användning: %s [FLAGGA] [SKALFORMAT]

source: Substitutes the values of environment variables.
it: Sostituisce i valori delle variabili d'ambiente.
sv: Ersätter värdena av miljövariabler.

source: Operation mode:
it: Modalità operativa:
sv: Körläge:

source: -v, --variables output the variables occurring in SHELL-FORMAT
it: -v, --variables mostra le variabili che appaiono in FORMATO-SHELL
sv: -v, --variables skriv ut variabler som förekommer i SKALFORMAT

source: Informative output:
it: Output informativo:
sv: Informativ utskrift:

source: -h, --help display this help and exit
it: -h, --help mostra questo aiuto ed esce
sv: -h, --help visa denna hjälptext och avsluta

source: -V, --version output version information and exit
it: -V, --version mostra le informazioni sulla versione ed esce
sv: -V, --version visa versionsinformation och avsluta

source: In normal operation mode, standard input is copied to standard output, with references to environment variables of the form $VARIABLE or ${VARIABLE} being replaced with the corresponding values. If a SHELL-FORMAT is given, only those environment variables that are referenced in SHELL-FORMAT are substituted; otherwise all environment variables references occurring in standard input are substituted.
it: Nella modalità operativa normale, lo standard input viene copiato sullo standard output, con i riferimenti alle variabili d'ambiente nella forma $VARIABILE o ${VARIABILE} sostituiti dai valori corrispondenti. Se è indicato un FORMATO-SHELL, solo le variabili d'ambiente referenziate in FORMATO-SHELL verranno sostituite; in caso contrario saranno sostituiti tutti i riferimenti alle variabili d'ambiente che appaiono sullo standard input.
sv: I normalt körläge kopieras standard in till standard ut med referenser till miljövariabler i form av $VARIABEL eller ${VARIABEL} ersatta med motsvarande värden. Om SKALFORMAT anges så ersätts bara de miljövariabler som refereras i SKALFORMAT; annars ersätts alla miljövariabler som hittas i standard in.

source: When --variables is used, standard input is ignored, and the output consists of the environment variables that are referenced in SHELL-FORMAT, one per line.
it: Quando viene usato --variables, lo standard input viene ignorato; l'output consiste delle variabili d'ambiente referenziate in FORMATO-SHELL, una per riga.
sv: När --variables används så ignoreras standard in och utdata består av de miljövariabler som förekommer i SKALFORMAT, en per rad.

source: Report bugs in the bug tracker at <%s> or by email to <%s>.
it: Segnalare i bug nel bug tracker all'indirizzo <%s> o tramite email a <%s>. Segnalare gli errori di traduzione a <tp@lists.linux.it>.
sv: Rapportera fel till feluppföljaren på <%s> eller med e-post till <%s>. Rapportera fel och synpunkter på översättningen till <tp-sv@listor.tp-sv.se>.

source: error while reading "%s"
it: errore durante la lettura di "%s"
sv: fel uppstod då ”%s” lästes

source: standard input
sv: standard in

source: Usage: %s [OPTION] [[TEXTDOMAIN] MSGID] or: %s [OPTION] -s [MSGID]...
it: Uso: %s [OPZIONE] [[DOMINIOTESTO] IDMSG] o: %s [OPZIONE] -s [IDMSG]...
sv: Användning: %s [FLAGGA] [[TEXTDOMÄN] MEDID] eller %s [FLAGGA] -s [MEDID]…

source: Display native language translation of a textual message.
it: Mostra la traduzione di un messaggio testuale nella lingua nativa.
sv: Visa lokala språkets översättning av textmeddelande.

source: Options and arguments:
it: Opzioni e argomenti:
sv: Flaggor och argument:

source: -d, --domain=TEXTDOMAIN retrieve translated messages from TEXTDOMAIN
it: -d, --domain=DOMINIOTESTO ricava i messaggi tradotti da DOMINIOTESTO
sv: -d, --domain=TEXTDOMÄN hämta översatta meddelanden från TEXTDOMÄN

source: -c, --context=CONTEXT specify context for MSGID
it: -c, --context=CONTESTO specifica il contesto per IDMSG
sv: -c, --context=KONTEXT ange kontext för MEDID

source: -e enable expansion of some escape sequences
it: -e abilita l'espansione di alcune sequenze di escape
sv: -e aktivera expansion av några styrsekvenser

source: -n suppress trailing newline
it: -n sopprime il ritorno a capo finale
sv: -n undertryck avslutande nyrad

source: -E (ignored for compatibility)
it: -E (ignorato per compatibilità)
sv: -E (ignoreras för kompatibilitet)

source: [TEXTDOMAIN] MSGID retrieve translated message corresponding to MSGID from TEXTDOMAIN
it: [DOMINIOTESTO] IDMSG ricava il messaggio tradotto corrispondente a IDMSG da DOMINIOTESTO
sv: [TEXTDOMÄN] MEDID hämta ett översatt meddelande motsvarande MEDID från TEXTDOMÄN

source: -h, --help display this help and exit
it: -h, --help mostra questo aiuto ed esce
sv: -h, --help visa denna hjälptext och avsluta

source: -V, --version display version information and exit
it: -V, --version mostra le informazioni sulla versione ed esce
sv: -V, --version visa versionsinformation och avsluta

source: If the TEXTDOMAIN parameter is not given, the domain is determined from the environment variable TEXTDOMAIN. If the message catalog is not found in the regular directory, another location can be specified with the environment variable TEXTDOMAINDIR. When used with the -s option the program behaves like the 'echo' command. But it does not simply copy its arguments to stdout. Instead those messages found in the selected catalog are translated. Standard search directory: %s
it: Se il parametro DOMINIOTESTO non è indicato, il dominio è determinato dalla variabile d'ambiente TEXTDOMAIN. Se il catalogo dei messaggi non si trova nella directory normale, può essere specificata un'altra posizione con la variabile d'ambiente TEXTDOMAINDIR. Quando usato con l'opzione -s, il programma si comporta come il comando "echo" ma, invece di copiare semplicemente gli argomenti su standard output, traduce i messaggi trovati nel catalogo selezionato. Directory di ricerca standard: %s
sv: Om parametern TEXTDOMÄN utelämnas bestäms domänen av miljövariabeln TEXTDOMAIN. Om meddelandekatalogen inte hittas i den normala katalogen så kan en annan katalog anges med miljövariabeln TEXTDOMAINDIR. När flaggan -s ges uppträder programmet som kommandot ”echo”. Men det kopierar inte enbart sina argument till standard ut. Istället översätts de argument som hittas i den valda meddelandekatalogen. Normal katalog för meddelandekataloger: %s

source: Usage: %s [OPTION] [TEXTDOMAIN] MSGID MSGID-PLURAL COUNT
it: Uso: %s [OPZIONE] [DOMINIOTESTO] IDMSG IDMSG-PLURALE CONTEGGIO
sv: Användning: %s [FLAGGA] [TEXTDOMÄN] MEDID MEDID-PLURAL ANTAL

source: Display native language translation of a textual message whose grammatical form depends on a number.
it: Mostra la traduzione di un messaggio di testo, la cui forma grammaticale dipende da un numero, nella lingua nativa.
sv: Visa översättningar i det lokala språket av textmeddelanden vars grammatiska form beror på ett tal.

source: -d, --domain=TEXTDOMAIN retrieve translated message from TEXTDOMAIN
it: -d, --domain=DOMINIOTESTO ricava messaggio tradotto da DOMINIOTESTO
sv: -d, --domain=TEXTDOMÄN hämta ett översatt meddelande från TEXTDOMÄN

source: [TEXTDOMAIN] retrieve translated message from TEXTDOMAIN
it: [DOMINIOTESTO] ricava messaggio tradotto da DOMINIOTESTO
sv: [TEXTDOMÄN] hämta ett översatt meddelande från TEXTDOMÄN

source: MSGID MSGID-PLURAL translate MSGID (singular) / MSGID-PLURAL (plural)
it: IDMSG IDMSG-PLURALE traduce IDMSG (singolare)/IDMSG-PLURALE (plurale)
sv: MEDID MEDID-PLURAL översätt MEDID (singularis) / MEDID-PLURAL (plural)

source: COUNT choose singular/plural form based on this value
it: CONTEGGIO seleziona la forma singolare/plurale in base a questo valore
sv: ANTAL välj singular/plural form baserat på detta värde

source: If the TEXTDOMAIN parameter is not given, the domain is determined from the environment variable TEXTDOMAIN. If the message catalog is not found in the regular directory, another location can be specified with the environment variable TEXTDOMAINDIR. Standard search directory: %s
it: Se il parametro DOMINIOTESTO non è indicato, il dominio è determinato dalla variabile d'ambiente TEXTDOMAIN. Se il catalogo dei messaggi non si trova nella directory normale, può essere specificata un'altra posizione con la variabile d'ambiente TEXTDOMAINDIR. Directory di ricerca standard: %s
sv: Om parametern TEXTDOMÄN utelämnas bestäms domänen av miljövariabeln TEXTDOMAIN. Om meddelandekatalogen inte hittas i den normala katalogen så kan en annan katalog anges med miljövariabeln TEXTDOMAINDIR. Normal katalog för meddelandekataloger: %s

source: In the directive number %zu, the argument number 0 is not a positive integer.
it: Nella direttiva numero %zu, l'argomento numero 0 non è un intero positivo.
sv: I direktiv nummer %zu är inte argument nummer 0 ett positivt heltal.

source: The string ends in the middle of a directive.
it: La stringa termina nel mezzo di una direttiva.
sv: Strängen slutar mitt i ett direktiv

source: In the directive number %zu, the character '%c' is not a valid conversion specifier.
it: Nella direttiva numero %zu, il carattere "%c" non è uno specificatore di conversione valido.
sv: I direktiv nummer %zu är inte tecknet ”%c” en giltig konverteringsspecificerare.

source: The character that terminates the directive number %zu is not a valid conversion specifier.
it: Il carattere che termina la direttiva numero %zu non è uno specificatore di conversione valido.
sv: Tecknet som avslutar direktiv nummer %zu är inte en giltig konverteringsspecificerare.

source: In the directive number %zu, the flag '%c' is invalid for the conversion '%c'.
it: Nella direttiva numero %zu, il flag "%c" non è valido per la conversione "%c".
sv: I direktiv nummer %zu är flaggan ”%c” felaktig för konverteringen ”%c”.

source: The string refers to arguments both through absolute argument numbers and through unnumbered argument specifications.
it: La stringa fa riferimento ad argomenti attraverso specifiche di argomento sia con numero che senza numero.
sv: Strängen refererar till argument både genom absoluta argumentnummer och genom onumrerade argumentspecifikationer.

source: The string ends in the middle of an escape sequence.
it: La stringa termina nel mezzo di una sequenza di escape.
sv: Strängen slutar mitt i en styrsekvens.

source: The escape sequence '%c%c' is unsupported (not in POSIX).
it: La sequenza di escape "%c%c" non è supportata (non in POSIX).
sv: Styrsevkensen ”%c%c” stödjs inte (inte i POSIX).

source: The escape sequence '%c%c' is invalid.
it: La sequenza di escape "%c%c" non è valida.
sv: Styrsekvensen ”%c%c” är felaktig.

source: This escape sequence is invalid.
it: La sequenza di escape non è valida.
sv: Denna styrsekvens är felaktig.

source: write error
it: errore di scrittura
sv: skrivfel

source: %s: expected a numeric value
it: %s: valore numerico atteso
sv: %s: ett numeriskt värde förväntades

source: %s: value not completely converted
it: %s: valore non convertito completamente
sv: %s: värdet är inte fullständigt konverterat

source: The translated format string consumes %zu arguments, whereas the original format string consumes only %zu arguments.
it: La stringa di formato tradotta consuma %zu argomenti, mentre il formato originale ne consuma solo %zu.
sv: Den översatta formatsträngen konsumerar %zu argument, medan originalets formatsträng endast konsumerar %zu argument.

source: warning: ignoring excess arguments, starting with %s
it: attenzione: argomenti in eccesso ignorati, a partire da %s
sv: varning: ignorerar överskjutande argument, med början vid %s

source: missing format string
it: stringa di formato mancante
sv: formatsträng saknas

source: Usage: %s [OPTION] FORMAT [ARGUMENT]...
it: Uso: %s [OPZIONE] FORMATO [ARGOMENTO]...
sv: Användning: %s [FLAGGA] FORMAT [ARGUMENT]…

source: Produces formatted output, applying the native language translation of FORMAT to the ARGUMENTs.
it: Produce un output formattato, applicando la traduzione in lingua madre di FORMATO agli ARGOMENTI.
sv: Producerar formaterad utdata, med tillämpning av det egna språkets översättning av FORMAT till ARGUMENTen.

source: -c, --context=CONTEXT specify context for FORMAT
it: -c, --context=CONTESTO specifica il contesto per FORMATO
sv: -c, --context=KONTEXT ange kontext för FORMAT

source: FORMAT format string
it: FORMATO stringa di formato
sv: FORMAT formatsträng

source: ARGUMENT string or numeric argument
it: ARGOMENTO stringa o argomento numerico
sv: ARGUMENT sträng- eller numeriskt argument

source: The format string consists of - plain text, - directives, that start with '%c', - escape sequences, that start with a backslash.
it: La stringa di formato consiste in - testo normale, - direttive, che iniziano con "%c", - sequenze di escape, che iniziano con un backslash.
sv: Formatsträngen består av - vanlig text, - direktiv, som inleds med ”%c”, - styrsekvenser, som inleds med ett omvänt snedstreck.

source: A directive that consumes an argument - starts with '%s' or '%s' where %s is a positive integer, - is optionally followed by any of the characters '%c', '%c', '%c', '%c', '%c', each of which acts as a flag, - is optionally followed by a width specification (a nonnegative integer), - is optionally followed by '%c' and a precision specification (an optional nonnegative integer), - is finished by a specifier - '%c', that prints a character, - '%c', that prints a string, - '%c', '%c', that print an integer, - '%c', '%c', '%c', '%c', that print an unsigned (nonnegative) integer, - '%c', '%c', that print a floating-point number in scientific notation, - '%c', '%c', that print a floating-point number without an exponent, - '%c', '%c', that print a floating-point number in general notation, - '%c', '%c', that print a floating-point number in hexadecimal notation. Additionally there is the directive '%s', that prints a single '%c'.
it: Una direttiva che richiede un argomento - inizia con "%s" o "%s", dove %s è un numero intero positivo, - è facoltativamente seguita da uno qualsiasi dei caratteri "%c", "%c", "%c", "%c", "%c", ognuno dei quali funge da flag, - è facoltativamente seguita da una specifica di larghezza (un numero intero non negativo), - è facoltativamente seguita da "%c" e da una specifica di precisione (un intero non negativo opzionale), - è completata da un identificatore - "%c", che stampa un carattere, - "%c", che stampa una stringa, - "%c", "%c", che stampano un numero intero, - "%c", "%c", "%c", "%c", che stampano un numero intero senza segno (non negativo), - "%c", "%c", che stampano un numero in virgola mobile in notazione scientifica, - "%c", "%c", che stampano un numero in virgola mobile senza esponente, - "%c", "%c", che stampano un numero in virgola mobile in notazione generale, - "%c", "%c", che stampano un numero in virgola mobile in notazione esadecimale. Inoltre, la direttiva "%s" stampa un singolo "%c".
sv: Ett direktiv som konsumerar ett argument - inleds med ”%s” eller ”%s” där %s är ett positivt heltal, - följs eventuellt av några av tecknen ”%c”, ”%c”, ”%c”, ”%c”, ”%c”, där var och ett fungerar som en flagga. - följs eventuellt av en breddspecifikation (ett ickenegativt heltal), - följs eventuellt av ”%c” och en precisionsspecifikation (ett eventuellt ickenegativt heltal), - avslutas med en speicficerare - ”%c”, som skriver ett tecken, - ”%c”, som skriver en sträng, - ”%c”, ”%c”, som skriver ett heltal, - ”%c”, ”%c”, ”%c”, ”%c”, som skriver ett teckenlöst (ickenegativt) heltal, - ”%c”, ”%c”, som skriver ett flyttal i vetenskaplig notation, - ”%c”, ”%c”, som skriver ett flyttal utan någon exponent, - ”%c”, ”%c”, som skriver ett flyttal i allmän notation, - ”%c”, ”%c”, som skriver ett flyttal i hexadecimal notation. Dessutom finns direktivet ”%s”, som skriver ett ensamt ”%c”.

source: If a directive specifies the argument by its number ('%s' notation), all directives that consume an argument must do so.
it: Se una direttiva specifica l'argomento con il suo numero (notazione "%s"), tutte le direttive che utilizzano un argomento devono farlo.
sv: Om ett direktiv anger argumentet med sitt nummer (notationen ”%s”), måste alla direktiv som konsumerar ett argument göra det.

source: The escape sequences are: %s backslash %s alert (BEL) %s backspace (BS) %s form feed (FF) %s new line (LF) %s carriage return (CR) %s horizontal tab (HT) %s vertical tab (VT) %s octal number with 1 to 3 octal digits
it: Le sequenze di escape sono: %s backslash %s allarme (BEL) %s backspace (BS) %s avanzamento pagina (FF) %s nuova riga (LF) %s ritorno a capo (CR) %s tabulazione orizzontale (HT) %s tabulazione verticale (VT) %s numero ottale con da 1 a 3 cifre ottali
sv: Styrsekvenserna är: %s omvänt snedstreck %s alarm (BEL) %s baksteg (BS) %s sidmatning (FF) %s nyrad (LF) %s vagnretur (CR) %s horisontell tabulator (HT) %s vertikal tabulator (VT) %s oktalt nummer med 1 till 3 oktala siffror

source: Environment variables:
it: Variabili d'ambiente:
sv: Miljövariabler:

source: The translation of the format string is looked up in the translation domain given by the environment variable %s.
it: La traduzione della stringa di formato viene cercata nel dominio di traduzione specificato dalla variabile d'ambiente %s.
sv: Översättningen av formatsträngen slås upp i översättningsdomänen som anges av miljövariabeln %s.

source: It is looked up in the catalogs directory given by the environment variable %s or, if not present, in the default catalogs directory. This binary is configured to use the default catalogs directory: %s
it: Viene cercato nella directory dei cataloghi indicata dalla variabile di ambiente %s o, se non presente, nella directory dei cataloghi predefinita. Questo binario è configurato per usare la directory predefinita dei cataloghi: %s
sv: Den slås upp i katalogmappen som ges av miljövariabeln %s eller, om den inte finns, i standardkatalogmappen. Denna binär är konfigurerad att använda standardkatalogmappen: %s

source: Usage: %s [OPTION] FORMAT FORMAT-PLURAL COUNT [ARGUMENT]...
it: Uso: %s [OPZIONE] FORMATO FORMATO-PLURALE CONTEGGIO [ARGOMENTO]...
sv: Användning: %s [FLAGGA] FORMAT FORMAT-PLURAL ANTAL [ARGUMENT]…

source: Produces formatted output, applying the native language translation of FORMAT and FORMAT-PLURAL, depending on COUNT, to the ARGUMENTs.
it: Produce un output formattato, applicando la traduzione in lingua madre di FORMATO e FORMATO-PLURALE, a seconda di CONTEGGIO, agli ARGOMENTI.
sv: Producerar formaterad utdata, med tillämpning av det egna språkets översättning av FORMAT och FORMAT-PLURAL, beroende på ANTAL, på ARGUMENTen.

source: FORMAT English singular form of format string
it: FORMATO Forma singolare inglese della stringa di formato
sv: FORMAT Engelsk singularform av formatsträngen

source: FORMAT-PLURAL English plural form of format string
it: FORMATO-PLURALE Forma plurale inglese della stringa di formato
sv: FORMAT-PLURAL Engelsk pluralform av formatsträngen

source: Each format string consists of - plain text, - directives, that start with '%c', - escape sequences, that start with a backslash.
it: Ciascuna stringa di formato consiste in - testo normale, - direttive, che iniziano con "%c", - sequenze di escape, che iniziano con un backslash.
sv: Varje formatsträng består av - vanlig text, - direktiv, som inleds med ”%c”, - styrsekvenser, som inleds med ett omvänt snedstreck.
